In [79]:
#__author__: Robert Moreno Carrillo
#__Updated at__: 20/07/2021

# Taller TAWS
# Introducción a la manipulación de datos con Python

In [1]:
# Importamos la librería pandas
import pandas as pd

# Estructuras básicas de pandas

#### Series

In [2]:
serie = pd.Series([9, 9.5 ,10 ,9.5 ,9])
serie

0     9.0
1     9.5
2    10.0
3     9.5
4     9.0
dtype: float64

#### Dataframe

In [3]:
df = pd.DataFrame({"nombres": ["Robert", "Camilo", "Eunice", "Paulette", "Josue"],"notas":serie })
df

    nombres  notas
0    Robert    9.0
1    Camilo    9.5
2    Eunice   10.0
3  Paulette    9.5
4     Josue    9.0

# Operaciones básicas con DataFrames

In [26]:
# Seaborn es una librería de visualizaciones, pero que cuenta con dataframes de ejemplo. 
import seaborn as sns
# Lectura de uno de los dataframes
tips = sns.load_dataset("tips")

In [29]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'tips',
 'titanic']

In [5]:
#Mostrar 5 primeras filas
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [6]:
#Mostrar 5 ultimas filas
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

### Seleccionar columnas

In [7]:
# Obtener solo la columna "total_bill" del dataframe tips
# Hint: Tal y como se haría en un diccionario de python

In [8]:
# Obtener columnas "total_bill" y "sex" del dataframe tips
# Hint: Utilizar doble []

In [9]:
# Qué sucede si utilizo doble [], y solo pongo una columna?

### Slicing

In [2]:
# Obtener las filas de la 10 a la 20 del dataset tips

In [11]:
# Obtener las filas de la 10 a la 20 de la columna total_bill del dataset tips

### iloc

In [12]:
#Mostrar el dataset
tips.head(2)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3

In [13]:
# Obtener las filas de la 10 a la 20 de la columna total_bill del dataset tips
# hint: tips.iloc[filas por posicion(no index), columnas por posición]
tips.iloc[10:21, 0]

10    10.27
11    35.26
12    15.42
13    18.43
14    14.83
15    21.58
16    10.33
17    16.29
18    16.97
19    20.65
20    17.92
Name: total_bill, dtype: float64

### loc

In [14]:
# Obtener las filas de la 10 a la 20 de la columna total_bill del dataset tips
# hint: tips.loc[filas por index, columnas por nombre]
tips.loc[10:21, "total_bill"]

10    10.27
11    35.26
12    15.42
13    18.43
14    14.83
15    21.58
16    10.33
17    16.29
18    16.97
19    20.65
20    17.92
21    20.29
Name: total_bill, dtype: float64

### iloc vs loc

In [1]:
# Imprimir tips.loc[10:15] vs tips.iloc[10:15]

In [16]:
# No es necesario comprender este código. Es solo para demostrar la diferencia entre iloc y loc 
# al hacer slicing de filas

#Pero si aún así quieres saber qué hace. Pues... crea una copia de tips y transforma los indices
tips2 = tips.copy()
tips2.index= "row-"+tips.index.map(str)

In [3]:
# Imprimir tips2.iloc[10:15]

In [4]:
# Cómo se debería utilizar iloc para obtener lo mismo?  Intentalo...

## Operaciones sobre columnas numericas

### Estadísticas de una columna numerica

In [5]:
### Calcular la media, mediana y desviación estándar de la columna tip. (Descomentar)

In [20]:
# Utilize la funcion describe sobre el dataframe tips
tips.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

### Operaciones con valores escalares

In [6]:
# Elevar al cuadrado la columna total_bill

### Operaciones vectoriales

In [7]:
# Sumar columna total_bill con la columna tip
'''Cuando hay dos pd.Series, siempre la operación vectorial se realiza con correspondencia de indices'''

<img src="https://www.simplypsychology.org/Z-score-formula.jpg" style="width:200px">

In [23]:
# Calcular una nueva columna llama "z_score_total_bill" calculada de la columna total_bill
# Hint: La formula para calcular el Z score se encuentra en la celda anterior, y se debe aplicar 
#       sobre cada valor de la columna total_bill

#tips["z_score_total_bill"] = ...

## Operaciones sobre columnas de texto

In [24]:
# Mostrar 2 primera filas
tips.head(2)

   total_bill   tip     sex smoker  day    time  size  z_score_total_bill
0       16.99  1.01  Female     No  Sun  Dinner     2           -0.314066
1       10.34  1.66    Male     No  Sun  Dinner     3           -1.061054

In [8]:
# Utilizar la función describe sobre el dataset tips, y poner como parámetro includo="all"

## Funciones basicas sobre columnas de texto

### Cuantas y cuales clases o categorías tengo en una columna de texto?

In [9]:
# Utilizar la función unique sobre la columna "Sex"

### Operaciones vectoriales

In [27]:
# Cree una columna que se llame "sex_and_smoker" y concatene los valores de las columnas "sex" y "smoker"
# Hint: como la columna tiene un tipo de categoria, se debe utilizar .astype(str) para hacer 
#       operaciones vectoriales de string.

#tips["sex_and_smoker"] = ...

,total_bill,tip,sex,smoker,day,time,size,z_score_total_bill,sex_and_smoker
0,16.99,1.01,Female,No,Sun,Dinner,2,-0.314066,Female and No
1,10.34,1.66,Male,No,Sun,Dinner,3,-1.061054,Male and No

### Uso de .str

Utilizando la función str es posible utilizar algunas funciones de string de python

In [11]:
# Imprima la columna Sex, con sus valores en mayuscula

### Cuantos elementos tengo de cada clase/categoria?

In [12]:
# Utilice la función value_counts para conocer la cantidad de veces que se repite una categoría o clase

## Filtrar un dataset

Para filtrar un dataset se utiliza el concepto de mascara booleana, al igual que en numpy.   
Ejemplo:

In [30]:
# Se crea la mascara booleana
mask = tips["sex"]=="Female"
# Se aplica la mascara booleana sobre el dataframe o serie. 
tips_female = tips[mask]
tips_female

,total_bill,tip,sex,smoker,day,time,size,z_score_total_bill,sex_and_smoker
0,16.99,1.01,Female,No,Sun,Dinner,2,-0.314066,Female and No
4,24.59,3.61,Female,No,Sun,Dinner,4,0.539635,Female and No
11,35.26,5.00,Female,No,Sun,Dinner,4,1.738187,Female and No
14,14.83,3.02,Female,No,Sun,Dinner,2,-0.556697,Female and No
16,10.33,1.67,Female,No,Sun,Dinner,3,-1.062178,Female and No
...,...,...,...,...,...,...,...,...,...
226,10.09,2.00,Female,Yes,Fri,Lunch,2,-1.089137,Female and Yes
229,22.12,2.88,Female,Yes,Sat,Dinner,2,0.262183,Female and Yes
238,35.83,4.67,Female,No,Sat,Dinner,3,1.802215,Female and No
240,27.18,2.00,Female,Yes,Sat,Dinner,2,0.830568,Female and Yes
243,18.78,3.00,Female,No,Thur,Dinner,2,-0.112997,Female and No

In [13]:
# Filtre el dataset tips a aquellos que tienen más de 20 en total_bill

In [14]:
# Filtre el dataset tips a aquellos que tienen más de 20 en total_bill y sean hombres
# Hint: Utilizar operadores &(and) y |(or)tips[tips["total_bill"]>20]
# Hint2: Utilizar parentesis para cada condición o máscara booleana

# Operaciones un de agrupación

In [15]:
# Cuanto en promedio dejan de propina un hombre y una mujer en el dataset tips
# Paso 1:  Seleccionar las columnas necesarias
# Paso 2:  Aplicar la función groupby, y dentro colocar la o las columnas por las que se desea agrupar
# Paso 3:  Finalmente poner una función de agregación: mean, median, std, count, sum, min, max...
tips[["sex", "tip"]].groupby("sex").mean()

In [16]:
# Promedio de total bill para cada uno de los días de la semana en el dataset tips

In [35]:
# Promedio de total bill agrupado por sex y smoker (Utilice la columna sex_and_smoker)
tips[["sex_and_smoker", "total_bill"]].groupby("sex_and_smoker").mean()

                total_bill
sex_and_smoker
Female and No    18.105185
Female and Yes   17.977879
Male and No      19.791237
Male and Yes     22.284500

In [36]:
# Haga lo mismo que en la celda anterior. Pero sin utilizar las columna sex_and_smoker
tips[["sex","smoker", "total_bill"]].groupby(["sex", "smoker" ]).mean()

               total_bill
sex    smoker
Male   Yes      22.284500
       No       19.791237
Female Yes      17.977879
       No       18.105185

# Apply

In [37]:
tips.head(2)

,total_bill,tip,sex,smoker,day,time,size,z_score_total_bill,sex_and_smoker
0,16.99,1.01,Female,No,Sun,Dinner,2,-0.314066,Female and No
1,10.34,1.66,Male,No,Sun,Dinner,3,-1.061054,Male and No

**Apply** me permite aplicar una funcion sobre cada uno de los datos de una serie. O sobre cada una de las filas de mi dataframe

La función debe ser de la forma:   
         
    nombre_funcion(valor)
    #Solo recibe un parámetro

In [38]:
# Ejemplo
def square_root(x):
    return x**(1/2)

tips["tip"].apply(square_root)

0      1.004988
1      1.288410
2      1.870829
3      1.819341
4      1.900000
         ...
239    2.433105
240    1.414214
241    1.414214
242    1.322876
243    1.732051
Name: tip, Length: 244, dtype: float64

In [39]:
# En el ejemplo anterior es posible hacerlo con operaciones vectoriales
tips["tip"]**(1/2)
# Cual creen es más eficiente?

0      1.004988
1      1.288410
2      1.870829
3      1.819341
4      1.900000
         ...
239    2.433105
240    1.414214
241    1.414214
242    1.322876
243    1.732051
Name: tip, Length: 244, dtype: float64

In [40]:
# Obtener una serie con la columna sex, pero reemplazando "Male" por "M" y "Female" por "F"
def transform_sex(sex):
    return sex[0]

tips["sex"].apply(transform_sex)

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: category
Categories (2, object): ['M', 'F']

## Funciones lambda

La funcion
    def nombre_funcion(x):  
        return y  

Es equivalente a 
    lambda x: y

In [25]:
# Realizar el mismo ejercicio de la columna sex, pero usando una función lambda
tips["sex"].apply(lambda sex: sex[0] )

## Apply de dataframes

<img src="https://www.simplypsychology.org/Z-score-formula.jpg" style="width:200px">

In [42]:
# Obtener el Z-score de la columna total_bill, pero que la media  y std correspondan a cada sexo.
# Y crear la columna z_score_total_bill_by_sex

# Otras funciones útiles

In [68]:
# Eliminar una columna
#del tips["size"]
#tips2.drop(['size'], axis=1)

In [ ]:
# Cambiar el nombre de todas las columnas
##tips.columns = lista de strings

In [ ]:
# Ordenar de forma descendente dataset de acuerdo al valor de la propina
#tips.sort_values("tip", ascending=False)

In [59]:
# Cambiar el nombre de una sola columna

In [65]:
# Obtener una muestra aleatoria
#tips.sample(20)

In [71]:
# Concatenar dos dataframes
#pd.concat([tips, tips2])

## Funciones útiles x2

* merge
* transform
* fillna
* cut